# Extraction

In [7]:
import os
os.chdir(r"C:\Users\LENOVO\Desktop\da\workshop\Pension_Management_System")

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

In [9]:
import pandas as pd

df = pd.read_csv("pension_dataset_20000.csv")

## Data exploration

In [10]:
df.shape

(20000, 19)

In [11]:
df.head()

,pensioner_id,name,dob,gender,join_date,retirement_date,years_of_service,monthly_pension,pension_type,lump_sum,region,last_contribution,spouse_count,beneficiary_name,payment_method,bank_account_mask,inflation_index,active_flag,created_at
0,P000001,Michael Martin,1973-12-22,M,1997-04-16,2030-07-10,17,735.61,Defined Benefit,0.00,West,2029-08-14,1,James Lopez,Bank Transfer,XXXX-XXXX-7396,1.0151,1,2023-11-11T17:10:25.588933
1,P000002,Thomas Martinez,1936-11-29,F,1968-05-29,2005-09-29,25,1756.99,Defined Benefit,0.00,South,2004-03-16,0,NaN,Bank Transfer,XXXX-XXXX-8513,1.0197,0,2024-05-12T17:10:25.589190
2,P000003,Mary Martin,1944-11-18,M,1974-04-03,2005-12-07,16,1042.74,Defined Contribution,0.00,East,2005-05-16,0,NaN,Bank Transfer,XXXX-XXXX-5297,1.0159,0,2023-03-08T17:10:25.589500
3,P000004,Susan Thomas,1948-05-21,M,1974-05-09,2018-04-06,23,1844.33,Defined Benefit,0.00,North,2018-02-13,0,James Lopez,Bank Transfer,XXXX-XXXX-6258,1.0209,0,2021-09-27T17:10:25.589788
4,P000005,Thomas Davis,1964-11-20,F,1987-03-19,2024-12-15,42,2172.51,Defined Benefit,60830.28,East,2024-11-18,1,John Smith,Bank Transfer,XXXX-XXXX-9110,1.0298,0,2021-11-03T17:10:25.590267

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   pensioner_id       20000 non-null  object
 1   name               20000 non-null  object
 2   dob                20000 non-null  object
 3   gender             20000 non-null  object
 4   join_date          20000 non-null  object
 5   retirement_date    20000 non-null  object
 6   years_of_service   20000 non-null  int64
 7   monthly_pension    20000 non-null  float64
 8   pension_type       20000 non-null  object
 9   lump_sum           20000 non-null  float64
 10  region             20000 non-null  object
 11  last_contribution  20000 non-null  object
 12  spouse_count       20000 non-null  int64
 13  beneficiary_name   11986 non-null  object
 14  payment_method     20000 non-null  object
 15  bank_account_mask  20000 non-null  object
 16  inflation_index    20000 non-null  float64
 17  active_flag        20000 non-null  int64
 18  created_at         20000 non-null  object
dtypes: float64(3), int64(3), object(13)
memory usage: 2.9+ MB

In [13]:
df.isnull().sum()

pensioner_id            0
name                    0
dob                     0
gender                  0
join_date               0
retirement_date         0
years_of_service        0
monthly_pension         0
pension_type            0
lump_sum                0
region                  0
last_contribution       0
spouse_count            0
beneficiary_name     8014
payment_method          0
bank_account_mask       0
inflation_index         0
active_flag             0
created_at              0
dtype: int64

In [14]:
df.duplicated().sum()

np.int64(0)

## Cleaning & Standardization

In [15]:
# formatting dates

In [16]:
date_col=['dob','join_date','retirement_date','last_contribution','created_at']

In [17]:
df[date_col]=df[date_col].apply(pd.to_datetime,errors='coerce')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   pensioner_id       20000 non-null  object
 1   name               20000 non-null  object
 2   dob                20000 non-null  datetime64[ns]
 3   gender             20000 non-null  object
 4   join_date          20000 non-null  datetime64[ns]
 5   retirement_date    20000 non-null  datetime64[ns]
 6   years_of_service   20000 non-null  int64
 7   monthly_pension    20000 non-null  float64
 8   pension_type       20000 non-null  object
 9   lump_sum           20000 non-null  float64
 10  region             20000 non-null  object
 11  last_contribution  20000 non-null  datetime64[ns]
 12  spouse_count       20000 non-null  int64
 13  beneficiary_name   11986 non-null  object
 14  payment_method     20000 non-null  object
 15  bank_account_mask  20000 non-null  object
 16  inflation_index    20000 non-null  float64
 17  active_flag        20000 non-null  int64
 18  created_at         20000 non-null  datetime64[ns]
dtypes: datetime64[ns](5), float64(3), int64(3), object(8)
memory usage: 2.9+ MB

In [19]:
df[date_col].isnull().sum()

dob                  0
join_date            0
retirement_date      0
last_contribution    0
created_at           0
dtype: int64

In [20]:
# correcting numerical errors

In [21]:
num_col=['years_of_service','monthly_pension','lump_sum','spouse_count','inflation_index']

In [22]:
for c in num_col:
    df[c] = pd.to_numeric(df[c], errors='coerce')

In [23]:
df.loc[df['monthly_pension'] < 0, 'monthly_pension'] = pd.NA
df.loc[df['lump_sum'] < 0, 'lump_sum'] = pd.NA
df.loc[df['years_of_service'] < 0, 'years_of_service'] = pd.NA
df.loc[df['spouse_count'] < 0, 'spouse_count'] = pd.NA

df.loc[df['years_of_service'] > 60, 'years_of_service'] = pd.NA
df.loc[df['spouse_count'] > 5, 'spouse_count'] = pd.NA

df.loc[(df['inflation_index'] < 0.5) | (df['inflation_index'] > 2.0), 'inflation_index'] = pd.NA

In [24]:
df[num_col].describe()

,years_of_service,monthly_pension,lump_sum,spouse_count,inflation_index
count,20000.000000,20000.000000,20000.000000,20000.00000,20000.000000
mean,27.505800,1749.776784,7181.930295,0.54840,1.019880
std,10.421545,449.809973,16356.581344,0.58726,0.010056
min,10.000000,215.230000,0.000000,0.00000,0.981500
25%,18.000000,1441.970000,0.000000,0.00000,1.013000
50%,27.000000,1748.005000,0.000000,0.00000,1.019700
75%,37.000000,2056.937500,0.000000,1.00000,1.026700
max,45.000000,3443.230000,103116.560000,2.00000,1.066900

In [25]:
# standardizing text fields

In [26]:
text_col= ['name','gender','pension_type','region','payment_method','beneficiary_name']

In [27]:
for c in text_col:
    df[c] = df[c].astype('string').str.strip().str.title()

In [28]:
df['beneficiary_name'] = df['beneficiary_name'].replace(
    {'NaN': pd.NA, 'None': pd.NA, '': pd.NA}
)

##	Data Consistency & Derivation

In [29]:
# Deriving age at retirement

In [30]:
df['age_at_retirement']=df['retirement_date'].dt.year - df['dob'].dt.year

In [31]:
df['age_at_retirement'].describe()

count    20000.000000
mean        62.436600
std          4.657732
min         53.000000
25%         58.000000
50%         62.000000
75%         66.000000
max         71.000000
Name: age_at_retirement, dtype: float64

In [32]:
# Deriving pension status

In [33]:
df['pension_status'] = df['active_flag'].map({
    1: 'Active',
    0: 'Retired'
})

In [34]:
# Re-calculating the years_of_service field

In [35]:
df['calculated_years_of_service']=df['retirement_date'].dt.year - df['join_date'].dt.year

In [36]:
df['service_years_diff'] = (
    df['years_of_service'] - df['calculated_years_of_service']
)

In [37]:
df[df['service_years_diff'] != 0][
    ['name','join_date', 'retirement_date', 'years_of_service',
     'calculated_years_of_service', 'service_years_diff']
].head()

,name,join_date,retirement_date,years_of_service,calculated_years_of_service,service_years_diff
0,Michael Martin,1997-04-16,2030-07-10,17.0,33,-16.0
1,Thomas Martinez,1968-05-29,2005-09-29,25.0,37,-12.0
2,Mary Martin,1974-04-03,2005-12-07,16.0,31,-15.0
3,Susan Thomas,1974-05-09,2018-04-06,23.0,44,-21.0
4,Thomas Davis,1987-03-19,2024-12-15,42.0,37,5.0

## 	Privacy Protection

In [38]:
df1=df.copy()

df1.drop(
    columns=['name', 'beneficiary_name', 'bank_account_mask'],
    inplace=True
)

In [39]:
df1.head()

,pensioner_id,dob,gender,join_date,retirement_date,years_of_service,monthly_pension,pension_type,lump_sum,region,last_contribution,spouse_count,payment_method,inflation_index,active_flag,created_at,age_at_retirement,pension_status,calculated_years_of_service,service_years_diff
0,P000001,1973-12-22,M,1997-04-16,2030-07-10,17.0,735.61,Defined Benefit,0.00,West,2029-08-14,1.0,Bank Transfer,1.0151,1,2023-11-11 17:10:25.588933,57,Active,33,-16.0
1,P000002,1936-11-29,F,1968-05-29,2005-09-29,25.0,1756.99,Defined Benefit,0.00,South,2004-03-16,0.0,Bank Transfer,1.0197,0,2024-05-12 17:10:25.589190,69,Retired,37,-12.0
2,P000003,1944-11-18,M,1974-04-03,2005-12-07,16.0,1042.74,Defined Contribution,0.00,East,2005-05-16,0.0,Bank Transfer,1.0159,0,2023-03-08 17:10:25.589500,61,Retired,31,-15.0
3,P000004,1948-05-21,M,1974-05-09,2018-04-06,23.0,1844.33,Defined Benefit,0.00,North,2018-02-13,0.0,Bank Transfer,1.0209,0,2021-09-27 17:10:25.589788,70,Retired,44,-21.0
4,P000005,1964-11-20,F,1987-03-19,2024-12-15,42.0,2172.51,Defined Benefit,60830.28,East,2024-11-18,1.0,Bank Transfer,1.0298,0,2021-11-03 17:10:25.590267,60,Retired,37,5.0

In [42]:
from dotenv import load_dotenv

load_dotenv()
print(os.getenv("DB_USER"))

root

In [43]:
from sqlalchemy import create_engine

# MySQL connection
username = os.getenv("DB_USER")
password = os.getenv("DB_PASSWORD")
host = os.getenv("DB_HOST")
port = os.getenv("DB_PORT", "3306")
db   = os.getenv("DB_NAME")


engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{db}"
                      )

In [44]:
# Write DataFrame to MySQL
table_name = "pension"

df1.to_sql(
    table_name,
    engine,
    if_exists="append",
    index=False
)


# Read back sample
pd.read_sql("SELECT * FROM pension LIMIT 5;", con=engine)

,pensioner_id,dob,gender,join_date,retirement_date,years_of_service,monthly_pension,pension_type,lump_sum,region,last_contribution,spouse_count,payment_method,inflation_index,active_flag,created_at,age_at_retirement,pension_status,calculated_years_of_service,service_years_diff
0,P000001,1973-12-22,M,1997-04-16,2030-07-10,17.0,735.61,Defined Benefit,0.00,West,2029-08-14,1.0,Bank Transfer,1.0151,1,2023-11-11 17:10:26,57,Active,33,-16.0
1,P000002,1936-11-29,F,1968-05-29,2005-09-29,25.0,1756.99,Defined Benefit,0.00,South,2004-03-16,0.0,Bank Transfer,1.0197,0,2024-05-12 17:10:26,69,Retired,37,-12.0
2,P000003,1944-11-18,M,1974-04-03,2005-12-07,16.0,1042.74,Defined Contribution,0.00,East,2005-05-16,0.0,Bank Transfer,1.0159,0,2023-03-08 17:10:26,61,Retired,31,-15.0
3,P000004,1948-05-21,M,1974-05-09,2018-04-06,23.0,1844.33,Defined Benefit,0.00,North,2018-02-13,0.0,Bank Transfer,1.0209,0,2021-09-27 17:10:26,70,Retired,44,-21.0
4,P000005,1964-11-20,F,1987-03-19,2024-12-15,42.0,2172.51,Defined Benefit,60830.28,East,2024-11-18,1.0,Bank Transfer,1.0298,0,2021-11-03 17:10:26,60,Retired,37,5.0